import React, { useState } from 'react';
import Modal from 'react-modal';
import axios from 'axios';


Modal.setAppElement('#root');

function MyModal(props) {
    const [modalIsOpen, setModalIsOpen] = useState(false);
    const [nameTeacher, setNameTeacher] = useState('');
    const [orcidTeacher, setOrcidTeacher] = useState('');
    const [rankTeacher, setRankTeacher] = useState('Працівник ЗСУ');
    const [positionTeacher, setPositionTeacher] = useState('');
    const [typeSection, setTypeSection] = useState('Кафедра');


    const [departmentTeacher, setDepartmentTeacher] = useState();
    const [section, setSection] = useState('');
    const ranks = [
        "Працівник ЗСУ",
        "Лейтенант",
        "Старший лейтенант",
        "Капітан",
        "Майор",
        "Підполковник",
        "Полковник",
        "Генерал-майор",
        "Генерал-лейтенант",
    ]

    const openModal = () => {
        setModalIsOpen(true);
    };

    const closeModal = () => {
        setModalIsOpen(false);
    };

    const handleTeacherNameChange = (event) => {
        setNameTeacher(event.target.value);
    };
    const handleSectionChange = (event) => {
        const parsedNumber = parseFloat(event.target.value);
        if (!isNaN(parsedNumber)) {
            setSection(parsedNumber)
        } else {
            setSection(event.target.value)
        }
    };
    const handleTypeSectionChange = (event) => {
        setTypeSection(event.target.value);
    };
    const handleRankTeacherChange = (event) => {
        setRankTeacher(event.target.value);
    };
    const handlePositionTeacherChange = (event) => {
        setPositionTeacher(event.target.value);
    };
    const handleTeacherOrcidChange = (event) => {
        setOrcidTeacher(event.target.value);
    };
    const handleTeacherDepartmentChange = (event) => {
        const parsedNumber = parseFloat(event.target.value);
        if (!isNaN(parsedNumber)) {
            setDepartmentTeacher(parsedNumber)
        } else {
            setDepartmentTeacher(event.target.value)
        }
    };
    const addNewDepartmentHandler = () => {
        if (departmentTeacher) {
            props.addNewDepartment(departmentTeacher)
        }
    }
    const handleSubmit = (event) => {
        event.preventDefault();
        const teacher = {
            // rank: rankTeacher,
            // fullName: nameTeacher,
            // position: positionTeacher,
            // section: section,
            // orcid: orcidTeacher,
            rank: "Полковник",
            fullName: "Павленко Олег Анатолійович",
            position: "Начальник кафедри",
            section: '1',
            orcid: "0000-0001-8752-1949"
        }
        const teachers1 = [
            // {
            //     rank: "Полковник",
            //     fullName: "Павленко Олег Анатолійович",
            //     position: "Начальник кафедри",
            //     section: '1',
            //     orcid: "0000-0001-8752-1949"
            // },
            {
                rank: "Підполковник",
                fullName: "Єсаулов Михайло Юрійович",
                position: "Заступник начальника кафедри",
                section: '1',
                orcid: "0000-0002-9981-9627"
            },
            {
                rank: "Полковник",
                fullName: "Селюк Володимир Миколайович",
                position: "Доцент кафедри",
                section: '1',
                orcid: "0000-0002-8003-5734"
            },
            {
                rank: "Полковник",
                fullName: "Мартинюк Андрій Володимирович",
                position: "Доцент кафедри",
                section: '1',
                orcid: "0009-0008-8607-3265"
            },
            {
                rank: "Підполковник",
                fullName: "Кочетков Олександр Володимирович",
                position: "Старший викладач кафедри – НІС",
                section: '1',
                orcid: "0009-0008-1448-4719"
            },
            {
                rank: "Підполковник",
                fullName: "Мальченко Валерій Миколайович",
                position: "Старший викладач кафедри – НРХБЗ",
                section: '1',
                orcid: "0009-0009-3604-1246"
            },
            {
                rank: "Підполковник",
                fullName: "Шмиголь Вячеслав Сергійович",
                position: "Старший викладач кафедри",
                section: '1',
                orcid: "0000-0002-7473-1506"
            },
            {
                rank: "Підполковник",
                fullName: "Моржецький Олександр Віталійович",
                position: "Старший викладач кафедри",
                section: '1',
                orcid: "0009-0001-3672-222Х"
            },
            {
                rank: "Підполковник",
                fullName: "Кривенко Олександр Володимирович",
                position: "Викладач кафедри",
                section: '1',
                orcid: "0009-0004-8730-4142"
            },
            {
                rank: "Підполковник",
                fullName: "Боголій Сергій Миколайович",
                position: "Викладач кафедри",
                section: '1',
                orcid: "0000-0001-8110-6322"
            },
            {
                rank: "Підполковник",
                fullName: "Шпанко Сергій Михайлович",
                position: "Викладач кафедри",
                section: '1',
                orcid: "0009-0002-3706-1328"
            },
            {
                rank: "Підполковник",
                fullName: "Примак Олександр Сергійович",
                position: "Викладач кафедри",
                section: '1',
                orcid: "0009-0005-0021-0619"
            },
            {
                rank: "Майор",
                fullName: "Татарчук Володимир Віталійович",
                position: "Викладач кафедри",
                section: '1',
                orcid: "0000-0002-2855-908Х"
            },
            {
                rank: "Майор",
                fullName: "Березюк Володимир Сергійович",
                position: "Викладач кафедри",
                section: '1',
                orcid: "0009-0001-3953-5964"
            },
            {
                rank: "Майор",
                fullName: "Кугот Олександр Леонідович",
                position: "Викладач кафедри",
                section: '1',
                orcid: "0009-0005-1339-6299"
            },
            {
                position: "Доцент",
                fullName: "Бірюков Павло Віталійович",
                rank: "Працівник ЗСУ",
                section: '1',
                orcid: "0000-0003-1703-1359"
            },
            {
                position: "Доцент",
                fullName: "Тарасюк Юрій Миколайович",
                rank: "Працівник ЗСУ",
                section: '1',
                orcid: "0000-0002-4714-1869"
            },
            {
                position: "Доцент",
                fullName: "Міхєєв Дмитро Павлович",
                rank: "Працівник ЗСУ",
                section: '1',
                orcid: "0009-0003-5825-4740"
            },
            {
                position: "Старший викладач",
                fullName: "Ахтанін Олексій Георгійович",
                rank: "Працівник ЗСУ",
                section: '1',
                orcid: "0009-0000-5065-6401"
            },
            {
                position: "Старший викладач",
                fullName: "Саливон Олександр Антонович",
                rank: "Працівник ЗСУ",
                section: '1',
                orcid: "0009-0003-4643-2212"
            },
            {
                position: "Викладач кафедри",
                fullName: "Присташ Валерій Олексійович",
                rank: "Працівник ЗСУ",
                section: '1',
                orcid: "0009-0001-7728-8546"
            },
            {
                position: "Викладач кафедри",
                fullName: "Кущик Андрій Іванович",
                rank: "Працівник ЗСУ",
                section: '1',
                orcid: "0009-0008-5926-9916"
            },
            {
                position: "Викладач кафедри",
                fullName: "Федоренко Сергій Вікторович",
                rank: "Працівник ЗСУ",
                section: '1',
                orcid: "0009-0004-5577-182Х"
            },
            {
                position: "Начальник кафедри",
                fullName: "Саєнко Олександр Григорович",
                rank: "Полковник",
                section: '3',
                orcid: "0000-0001-7127-6686"
            },
            {
                position: "Професор кафедри",
                fullName: "Чорний Віталій Сергійович",
                rank: "Працівник ЗСУ",
                section: '3',
                orcid: "0000-0003-0342-1188"
            },
            {
                position: "Доцент кафедри",
                fullName: "Кримець Людмила Володимирівна",
                rank: "Працівник ЗСУ",
                section: '3',
                orcid: "0000-0001-7451-5208"
            },
            {
                position: "Доцент кафедри",
                fullName: "Логвіненко Наталія Михайлівна",
                rank: "Працівник ЗСУ",
                section: '3',
                orcid: "0000-0002-4527-5388"
            },
            {
                position: "Доцент кафедри",
                fullName: "Козубцов Ігор Миколайович",
                rank: "Працівник ЗСУ",
                section: '3',
                orcid: "0000-0002-7309-4365"
            },
            {
                position: "Старший викладач",
                fullName: "Скідан Роман Олександрович",
                rank: "Підполковник",
                section: '3',
                orcid: "0000-0003-4907-1662"
            },
            {
                position: "Старший викладач",
                fullName: "Ступеньков Сергій Олександрович",
                rank: "Підполковник",
                section: '3',
                orcid: "0000-0002-6420-6732"
            },
            {
                position: "Старший викладач",
                fullName: "Садикова Вікторія Вікторівна",
                rank: "Працівник ЗСУ",
                section: '3',
                orcid: "0000-0002-4030-9681"
            },
            {
                position: "Викладач кафедри",
                fullName: "Манзя Євгеній В’ячеславович",
                rank: "Майор",
                section: '3',
                orcid: "0000-0002-5350-1162"
            },
            {
                position: "Викладач кафедри",
                fullName: "Церковняк-Городецька Олеся Георгіївна",
                rank: "Працівник ЗСУ",
                section: '3',
                orcid: "0000-0002-9596-6822"
            },
            {
                position: "Завідувач кафедри",
                fullName: "Козубцова Леся Михайлівна",
                rank: "Працівник ЗСУ",
                section: '4',
                orcid: "0000-0002-7866-8575"
            },
            {
                position: "Заступник завідувача кафедри",
                fullName: "Бескровний Олексій Іванович",
                rank: "Працівник ЗСУ",
                section: '4',
                orcid: "0000-0001-7191-7957"
            },
            {
                position: "Доцент",
                fullName: "Авдонін Костянтин Вікторович",
                rank: "Працівник ЗСУ",
                section: '4',
                orcid: "0000-0001-6805-0870"
            },
            {
                position: "Доцент",
                fullName: "Ісаєнко Галина Леонідівна",
                rank: "Працівник ЗСУ",
                section: '4',
                orcid: "0000-0003-0479-9596"
            },
            {
                position: "Доцент",
                fullName: "Мироненко Ольга Всеволодівна",
                rank: "Працівник ЗСУ",
                section: '4',
                orcid: "0000-0002-3763-5478"
            },
            {
                position: "Доцент",
                fullName: "Пасенченко Юрій Антонович",
                rank: "Працівник ЗСУ",
                section: '4',
                orcid: "0000-0003-4919-5841"
            },
            {
                position: "Старший викладач",
                fullName: "Палагута Анастасія Михайлівна",
                rank: "Працівник ЗСУ",
                section: '4',
                orcid: "0000-0002-5917-6874"
            },
            {
                position: "Старший викладач",
                fullName: "Сновида Вікторія Євгеніївна",
                rank: "Працівник ЗСУ",
                section: '4',
                orcid: "0000-0002-5539-2588"
            },
            {
                position: "Старший викладач",
                fullName: "Соловйова Тетяна Василівна",
                rank: "Працівник ЗСУ",
                section: '4',
                orcid: "0009-0009-8338-8410"
            },
            {
                position: "Викладач кафедри",
                fullName: "Зубко Олександр Анатолійович",
                rank: "Працівник ЗСУ",
                section: '4',
                orcid: "0000-0002-4580-6919"
            },
            {
                position: "Викладач кафедри",
                fullName: "Огнєва Людмила Гаврилівна",
                rank: "Працівник ЗСУ",
                section: '4',
                orcid: "0000-0002-2127-3740"
            },
            {
                position: "Викладач кафедри",
                fullName: "Сухомлинова Олена Валеріївна",
                rank: "Працівник ЗСУ",
                section: '4',
                orcid: "0000-0001-7592-7255"
            },
            {
                position: "Викладач кафедри",
                fullName: "Тульчинська Дар’я Миколаївна",
                rank: "Працівник ЗСУ",
                section: '4',
                orcid: "0000-0002-0680-2675"
            },
            {
                position: "Начальник кафедри",
                fullName: "Клімович Сергій Олегович",
                rank: "Полковник",
                section: '12',
                orcid: "0000-0001-7209-2176"
            },
            {
                position: "Викладач кафедри",
                fullName: "Загоровець Олег Вікторович",
                rank: "Майор",
                section: '12',
                orcid: "0009-0008-2566-9217"
            },
            {
                position: "Викладач кафедри",
                fullName: "Балан Андрій Васильович",
                rank: "Майор",
                section: '12',
                orcid: "0009-0008-7567-0339"
            },
            {
                position: "Старший викладач кафедри",
                fullName: "Толстих Василь Анатолійович",
                rank: "Працівник ЗСУ",
                section: '12',
                orcid: "0000-0003-4067-8441"
            },
            {
                position: "Начальник кафедри",
                fullName: "Кузавков Василь Вікторович",
                rank: "Полковник",
                section: '13',
                orcid: "0000-0002-0655-9759"
            },
            {
                position: "Старший викладач кафедри",
                fullName: "Борисов Олег Володимирович",
                rank: "Підполковник",
                section: '13',
                orcid: "0000-0002-9460-2605"
            },
            {
                position: "Викладач кафедри",
                fullName: "Лукіна Катерина Вікторівна",
                rank: "Підполковник",
                section: '13',
                orcid: "0000-0002-2803-7839"
            },
            {
                position: "Старший викладач кафедри",
                fullName: "Романенко Марія Михайлівна",
                rank: "Майор",
                section: '13',
                orcid: "0000-0002-0646-2797"
            },
            {
                position: "Доцент кафедри",
                fullName: "Корольов Андрій Павлович",
                rank: "Працівник ЗСУ",
                section: '13',
                orcid: "0000-0001-6281-063X"
            },
            {
                position: "Старший викладач кафедри",
                fullName: "Мацаєнко Андрій Володимирович",
                rank: "Працівник ЗСУ",
                section: '13',
                orcid: "0000-0003-1149-7318"
            },
            {
                position: "Професор кафедри",
                fullName: "Зибін Сергій Вікторович",
                rank: "Працівник ЗСУ",
                section: '13',
                orcid: "0000-0002-2670-2823"
            },
            {
                position: "Начальник факультету",
                fullName: "Черня Ігор Петрович",
                rank: "Полковник",
                orcid: "0009-0008-5334-9894",
                section:  '21',
            },
            {
                position: "Начальник кафедри",
                fullName: "Троцько Олександр Олександрович",
                rank: "Полковник",
                orcid: "0000-0001-7535-5023",
                section:  '21',
            },
            {
                position: "Доцент кафедри",
                fullName: "Симоненко Олександр Анатолійович",
                rank: "Підполковник",
                orcid: "0000-0001-8511-2017",
                section:  '21',
            },
            {
                position: "Старший викладач кафедри",
                fullName: "Кондрусь Андрій Володимирович",
                rank: "Підполковник",
                orcid: "0000-0001-8815-6517",
                section:  '21',
            },
            {
                position: "Старший викладач кафедри",
                fullName: "Мягких Геннадій Геннадійович",
                rank: "Майор",
                orcid: "0000-0003-4491-5395",
                section:  '21',
            },
            {
                position: "Викладач кафедри",
                fullName: "Балан Дмитро Дмитрович",
                rank: "Майор",
                orcid: "0000-0002-6714-8718",
                section:  '21',
            },
            {
                position: "Викладач кафедри",
                fullName: "Величко Віра Петрівна",
                rank: "Майор",
                orcid: "0000-0001-9654-4560",
                section:  '21',
            },
            {
                position: "Викладач кафедри",
                fullName: "Пилипчук Ігор Юрійович",
                rank: "Майор",
                orcid: "0000-0002-5550-8026",
                section:  '21',
            },
            {
                position: "Професор кафедри",
                fullName: "Романюк Валерій Антонович",
                rank: "Працівник ЗСУ",
                orcid: "0000-0002-6218-2327",
                section:  '21',
            },
            {
                position: "Доцент кафедри",
                fullName: "Грохольський Ярослав Михайлович",
                rank: "Працівник ЗСУ",
                orcid: "0000-0001-6131-970X",
                section:  '21',
            },
            {
                position: "Викладач кафедри",
                fullName: "Бондаренко Іван Олександрович",
                rank: "Майор",
                orcid: "0000-0002-7516-7580",
                section:  '21',
            },
            {
                position: "Ад’юнкт кафедри",
                fullName: "Гаман Олександр Васильович",
                rank: "Підполковник",
                orcid: "0000-0003-4676-3321",
                section:  '21',
            },
            {
                position: "Ад’юнкт кафедри",
                fullName: "Меркотан Дмитро Юрійович",
                rank: "Підполковник",
                orcid: "0000-0003-1425-9948",
                section:  '21',
            },
            {
                position: "Викладач кафедри",
                fullName: "Нерознак Євгеній Ігорович",
                rank: "Майор",
                orcid: "0000-0001-5641-5473",
                section:  '21',
            },
            {
                position: "Ад’юнкт кафедри",
                fullName: "Громлюк Катерина Андріївна",
                rank: "Майор",
                orcid: "0000-0002-0617-7849",
                section:  '21',
            },
            {
                rank: "Полковник",
                fullName: "Бовда Едуард Миколайович",
                position: "Начальник кафедри",
                orcid: "0000-0002-8267-2120",
                section:  '22',
            },
            {
                rank: "Підполковник",
                fullName: "Нестеренко Микола Миколайович",
                position: "Заступник начальника кафедри",
                orcid: "0000-0003-0812-2793",
                section:  '22',
            },
            {
                rank: "Підполковник",
                fullName: "Фесьоха Віталій Вікторович",
                position: "Доцент кафедри",
                orcid: "0000-0001-6612-1970",
                section:  '22',
            },
            {
                rank: "Підполковник",
                fullName: "Редзюк Євгеній Володимирович",
                position: "Доцент кафедри",
                orcid: "0000-0001-5592-5121",
                section:  '22',
            },
            {
                rank: "Підполковник",
                fullName: "Легкобит Володимир Сергійович",
                position: "Старший викладач кафедри",
                orcid: "0000-0002-9118-4188",
                section:  '22',
            },
            {
                rank: "Підполковник",
                fullName: "Костенко Віталій Петрович",
                position: "Старший викладач кафедри",
                orcid: "0000-0002-7180-233X",
                section:  '22',
            },
            {
                rank: "Підполковник",
                fullName: "Фесьоха Надія Олександрівна",
                position: "Старший викладач кафедри",
                orcid: "0000-0002-9797-5589",
                section:  '22',
            },
            {
                rank: "Майор",
                fullName: "Стоцький Іван Володимирович",
                position: "Викладач кафедри",
                orcid: "0000-0002-5898-3228",
                section:  '22',
            },
            {
                rank: "Майор",
                fullName: "Налісний Генадій Іванович",
                position: "Викладач кафедри",
                orcid: "0009-0000-5142-3677",
                section:  '22',
            },
            {
                rank: "Майор",
                fullName: "Романенко Сергій Олексійович",
                position: "Викладач кафедри",
                orcid: "0009-0004-0240-0777",
                section:  '22',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Горбенко Володимир Іванович",
                position: "Професор кафедри",
                orcid: "0000-0003-1928-3058",
                section:  '22',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Субач Ігор Юрийович",
                position: "Професор кафедри",
                orcid: "0000-0002-9344-713X",
                section:  '22',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Самохвалов Юрій Якович",
                position: "Професор кафедри",
                orcid: "0000-0001-5123-1288",
                section:  '22',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Любарський Сергій Володимирович",
                position: "Доцент кафедри",
                orcid: "0000-0001-8068-1106",
                section:  '22',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Успенський Олександр Анатолійович",
                position: "Доцент кафедри",
                orcid: "0000-0001-6953-421X",
                section:  '22',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Макарчук Олександр Мусійович",
                position: "Доцент кафедри",
                orcid: "0000-0002-0374-369X",
                section:  '22',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Гриньков Володимир Олександрович",
                position: "Доцент кафедри",
                orcid: "0000-0002-9574-3792",
                section:  '22',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Клименко Віктор Геннадійович",
                position: "Старший викладач кафедри",
                orcid: "0000-0001-7834-7213",
                section:  '22',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Кондратюк Андрій Георгійович",
                position: "Старший викладач кафедри",
                orcid: "0000-0002-8485-3160",
                section:  '22',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Тетерятник Ігор Вікторович",
                position: "Старший викладач кафедри",
                orcid: "0000-0002-6826-5035",
                section:  '22',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Стемпковська Яна Андріївна",
                position: "Старший викладач кафедри",
                orcid: "0000-0002-5489-4834",
                section:  '22',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Шарнін Сергій Анатолійович",
                position: "Викладач кафедри",
                orcid: "0000-0002-5856-3995",
                section:  '22',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Задворний Андрій Васильович",
                position: "Викладач кафедри",
                orcid: "0000-0003-1045-6004",
                section:  '22',
            },
            {
                rank: "Підполковник",
                fullName: "Гулій Володимир Станіславович",
                position: "Заступник начальника кафедри",
                orcid: "0000-0002-9526-4070",
                section:  '23',
            },
            {
                rank: "Підполковник",
                fullName: "Яровий Віталій Сергійович",
                position: "Професор",
                orcid: "0000-0002-8239-1150",
                section:  '23',
            },
            {
                rank: "Підполковник",
                fullName: "Жилінський Ігор Васильович",
                position: "Доцент",
                orcid: "0009-0006-4164-9457",
                section:  '23',
            },
            {
                rank: "Підполковник",
                fullName: "Ющенко Юрій Миколайович",
                position: "Старший викладач - начальник служби пожежної безпеки",
                orcid: "0009-0000-3574-2504",
                section:  '23',
            },
            {
                rank: "Майор",
                fullName: "Фесенко Олексій Дмитрович",
                position: "Викладач кафедри",
                orcid: "0000-0002-2114-5327",
                section:  '23',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Коваленко Іван Миколайович",
                position: "Доцент",
                orcid: "0009-0000-8920-1332",
                section:  '23',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Терещенко Олексій Миколайович",
                position: "Старший викладач",
                orcid: "0009-0007-3382-5075",
                section:  '23',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Чорненький Володимир Степанович",
                position: "Викладач кафедри",
                orcid: "0009-0009-7994-0452",
                section:  '23',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Зайко Віктор Володимирович",
                position: "Викладач кафедри",
                orcid: "0009-0006-1835-6349",
                section:  '23',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Заєць Наталія Леонідівна",
                position: "Викладач кафедри",
                orcid: "0009-0009-1073-3076",
                section:  '23',
            },
            {
                rank: "Підполковник",
                fullName: "Нестеров Олександр Миколайович",
                position: "Начальник кафедри",
                orcid: "0000-0001-5092-6205",
                section:  '31',
            },
            {
                rank: "Підполковник",
                fullName: "Ольшанський Валентин Вікторович",
                position: "Доцент кафедри",
                orcid: "0000-0002-5788-8173",
                section:  '31',
            },
            {
                rank: "Підполковник",
                fullName: "Філіпов Вячеслав Васильович",
                position: "Доцент кафедри",
                orcid: "0000-0001-7854-6693",
                section:  '31',
            },
            {
                rank: "Полковник",
                fullName: "Лазарь Борис Богданович",
                position: "Старший викладач",
                orcid: "0009-0006-8934-6092",
                section:  '31',
            },
            {
                rank: "Підполковник",
                fullName: "Фисюк Артем Олександрович",
                position: "Старший викладач",
                orcid: "0009-0001-8998-9956",
                section:  '31',
            },
            {
                rank: "Підполковник",
                fullName: "Стойчев Максим Іванович",
                position: "Старший викладач",
                orcid: "0009-0002-7423-2384",
                section:  '31',
            },
            {
                rank: "Підполковник",
                fullName: "Стозуб Василь Олександрович",
                position: "Старший викладач",
                orcid: "0009-0004-7050-5589",
                section:  '31',
            },
            {
                rank: "Майор",
                fullName: "Пуштарик Олексій Сергійович",
                position: "Викладач кафедри",
                orcid: "0009-0000-9825-0726",
                section:  '31',
            },
            {
                rank: "Майор",
                fullName: "Кіяновський Костянтин Михайлович",
                position: "Викладач кафедри",
                orcid: "0009-0000-1476-5846",
                section:  '31',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Козубцов Ігор Миколайович",
                position: "Професор",
                orcid: "0000-0002-7309-4365",
                section:  '31',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Шолудько Василь Григорович",
                position: "Доцент",
                orcid: "0009-0000-1889-9171",
                section:  '31',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Стовба Євген Миколайович",
                position: "Викладач кафедри",
                orcid: "0009-0006-0572-6347",
                section:  '31',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Арсенович Антон Дмитрович",
                position: "Викладач кафедри",
                orcid: "0009-0000-7674-8953",
                section:  '31',
            },
            {
                rank: "Полковник",
                fullName: "Панченко Ігор В’ячеславович",
                position: "Начальник кафедри",
                orcid: "0000-0001-5690-3813",
                section:  '32',
            },
            {
                rank: "Підполковник",
                fullName: "Восколович Олексій Іванович",
                position: "Доцент",
                orcid: "0000-0002-6353-868X",
                section:  '32',
            },
            {
                rank: "Підполковник",
                fullName: "Бернацький Андрій Петрович",
                position: "Старший викладач",
                orcid: "0000-0003-0397-075X",
                section:  '32',
            },
            {
                rank: "Підполковник",
                fullName: "Макаренко Олександр Олексійович",
                position: "Старший викладач",
                orcid: "0000-0003-0875-4387",
                section:  '32',
            },
            {
                rank: "Підполковник",
                fullName: "Колтовський Дмитро Геннадійович",
                position: "Викладач кафедри",
                orcid: "0000-0002-2751-412X",
                section:  '32',
            },
            {
                rank: "Майор",
                fullName: "Петрова Дар’я Володимирівна",
                position: "Викладач кафедри",
                orcid: "0000-0001-7512-6271",
                section:  '32',
            },
            {
                rank: "Майор",
                fullName: "Терегеря Євгеній Олексійович",
                position: "Викладач кафедри",
                orcid: "0000-0002-4447-3411",
                section:  '32',
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Слотвінська Людмила Іванівна",
                position: "Викладач ВНЗ",
                orcid: "0000-0003-2409-6206",
                section:  '32',
            },
            {
                rank: "Старший солдат",
                fullName: "Чикрій Кирило Аркадійович",
                position: "Технік групи спецозброєння НЛК",
                orcid: "0000-0001-9378-1122",
                section:  '32',
            },
            {
                rank: "Полковник",
                fullName: "Масесов Микола Олександрович",
                position: "Начальник НЦЗІ",
                orcid: "0000-0003-4537-4295",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "ПРИС Геннадій Петрович",
                position: "Заступник начальника НЦЗІ",
                orcid: "0000-0002-8081-4391",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Зінченко Михайло Олександрович",
                position: "Начальник НДУ № 1",
                orcid: "0000-0002-1428-8231",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Совік Олександр Васильович",
                position: "ГНС НДУ №1",
                orcid: "0000-0003-4356-8790",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Яковчук Олександр Вікторович",
                position: "Начальник НДВ №11 – заступник начальника НДУ №1",
                orcid: "0000-0002-6312-5009",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Думітраш Вячеслав Олексійович",
                position: "ПНС",
                orcid: "0000-0003-1996-3096",
                section: "НЦЗІ"
            },
            {
                rank: "Майор",
                fullName: "Кокошинський Віталій Валерійович",
                position: "НС НДВ №11",
                orcid: "0000-0001-6364-6261",
                section: "НЦЗІ"
            },
            {
                rank: "Капітан",
                fullName: "Осьмак Олена Юріївна",
                position: "МНС НДВ №11",
                orcid: "0000-0002-6900-7732",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Руденко Володимир Іванович",
                position: "СНС НДВ №11",
                orcid: "0000-0003-3536-548Х",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Бондаренко Леонід Олександрович",
                position: "СНС НДВ №11",
                orcid: "0000-0003-1850-0508",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Плугова Ольга Богданівна",
                position: "НС НДВ №11",
                orcid: "0000-0001-7848-7806",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Лазута Роман Романович",
                position: "Начальник НДВ №12",
                orcid: "0000-0003-3254-9690",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Макарчук Василь Іванович",
                position: "СНС НДВ №12",
                orcid: "0000-0002-3997-4684",
                section: "НЦЗІ"
            },
            {
                rank: "Майор",
                fullName: "Бузаява Катерина Олександрівна",
                position: "НС НДВ №12",
                orcid: "0000-0003-2059-5761",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Миночкін Анатолій Іванович",
                position: "ПНС НДВ №12",
                orcid: "0000-0001-5723-5052",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Андрух Олександр Олександрович",
                position: "СНС НДВ №12",
                orcid: "0000-0002-3594-5499",
                section: "НЦЗІ"
            },
            {
                rank: "Майор",
                fullName: "Скляров Олексій Вікторович",
                position: "ПНС НДЛ №13",
                orcid: "0000-0002-5694-3900",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Комаров Володимир Олександрович",
                position: "ПНС НДЛ №13",
                orcid: "0000-0002-4929-4527",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Радченко Микола Миколайович",
                position: "НС НДЛ №13",
                orcid: "0000-0002-8272-0727",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Драглюк Олексій Вікторович",
                position: "Начальник НДУ №2",
                orcid: "0000-0001-8572-7275",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Данилюк Ігор Андрійович",
                position: "ГНС НДУ №2",
                orcid: "0000-0003-0955-0108",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Шаповал Віталій Михайлович",
                position: "Начальник НДВ №21 – заступник начальника НДУ №2",
                orcid: "0000-0003-4637-9362",
                section: "НЦЗІ"
            },
            {
                rank: "Майор",
                fullName: "Тітаренко Андрій Володимирович",
                position: "НС НДВ №21",
                orcid: "0000-0003-2803-0861",
                section: "НЦЗІ"
            },
            {
                rank: "Лейтенант",
                fullName: "Ковальчук Богдан Петрович",
                position: "МНС НДВ №21",
                orcid: "0000-0001-5219-7624",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Карпенко Андрій Олександрович",
                position: "НС НДВ №21",
                orcid: "0000-0002-8372-6303",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Пилипчук Юрій Віталійович",
                position: "ПНС НДВ №22",
                orcid: "0000-0002-3544-7895",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Коваленко Ілля Григорович",
                position: "СНС НДВ №22",
                orcid: "0000-0002-6827-5196",
                section: "НЦЗІ"
            },
            {
                rank: "Майор",
                fullName: "Панкратова Альона Анатоліївна",
                position: "НС НДВ №22",
                orcid: "0009-0002-5315-8453",
                section: "НЦЗІ"
            },
            {
                rank: "Капітан",
                fullName: "Бокій Олена Володимирівна",
                position: "МНС НДВ №22",
                orcid: "0009-0006-3459-5665",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Мусієнко Володимир Анатолійович",
                position: "СНС НДВ №22",
                orcid: "0000-0002-4909-6045",
                section: "НЦЗІ"
            },
            {
                rank: "Полковник",
                fullName: "Османов Руслан Нариманович",
                position: "Начальник НДВ №23",
                orcid: "0000-0001-9081-2034",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Краснобокий Андрій Васильович",
                position: "СНС НДВ №23",
                orcid: "0000-0002-4878-1585",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Кубік Сергій Іванович",
                position: "НС НДВ №23",
                orcid: "0009-0008-8378-8820",
                section: "НЦЗІ"
            },
            {
                rank: "Капітан",
                fullName: "Панченко Роман В’ячеславович",
                position: "МНС НДВ №23",
                orcid: "0000-0001-7769-6315",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Паламарчук Світлана Анатоліївна",
                position: "Начальник НДУ №3",
                orcid: "0000-0001-7483-9165",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Шемендюк Олександр Віталійович",
                position: "Начальник НДВ №31 – заступник начальника НДУ №3",
                orcid: "0000-0002-5594-2973",
                section: "НЦЗІ"
            },
            {
                rank: "Полковник",
                fullName: "Богдан Володимир Миколайович",
                position: "ПНС НДВ №31",
                orcid: "0009-0007-9626-4607",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Гаврилюк Оксана Григорівна",
                position: "СНС НДВ №31",
                orcid: "0000-0001-8694-7251",
                section: "НЦЗІ"
            },
            {
                rank: "Майор",
                fullName: "Ляшенко Ганна Тарасівна",
                position: "НС НДВ №31",
                orcid: "0000-0002-5318-8663",
                section: "НЦЗІ"
            },
            {
                rank: "Капітан",
                fullName: "Фомкін Денис Валентинович",
                position: "МНС НДВ №31",
                orcid: "0000-0003-0128-9355",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Овсянніков Вячеслав Володимирович",
                position: "ПНС НДВ №31",
                orcid: "0000-0003-0186-6220",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Ткач Володимир Олександрович",
                position: "СНС НДВ №31",
                orcid: "0000-0003-0013-7368",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Панченко Сергій Миколайович",
                position: "СНС НДВ №31 0,5",
                orcid: "0000-0003-2371-1676",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Штонда Роман Михайлович",
                position: "Начальник НДВ №32",
                orcid: "0000-0001-5986-0847",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Нещерет Іван Григорович",
                position: "ПНС НДВ №32",
                orcid: "0000-0002-3500-5683",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Бондаренко Тетяна Василівна",
                position: "СНС НДВ №32",
                orcid: "0000-0002-2879-2041",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Черниш Юлія Олександрівна",
                position: "СНС НДВ №32",
                orcid: "0000-0002-6626-5656",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Терещенко Тетяна Павлівна",
                position: "СНС НДВ №32",
                orcid: "0000-0002-9659-7897",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Хорошко Володимир Олексійович",
                position: "НС НДВ №32",
                orcid: "0000-0001-6213-7086",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Паламарчук Наталія Анатоліївна",
                position: "Начальник НДЛ №33",
                orcid: "0000-0001-8818-7794",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Процюк Юрій Олександрович",
                position: "ПНС НДЛ №33",
                orcid: "0000-0001-5193-3669",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Мартинюк Віталій Валерійович",
                position: "ПНС НДЛ №33",
                orcid: "0000-0003-0244-7861",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Чередниченко Олексій Юрійович",
                position: "СНС НДЛ №33",
                orcid: "0000-0002-0816-8321",
                section: "НЦЗІ"
            },
            {
                rank: "Майор",
                fullName: "Сердюк Павло Євгенійович",
                position: "НС НДЛ №33",
                orcid: "0000-0002-5497-456X",
                section: "НЦЗІ"
            },
            {
                rank: "Старший лейтенант",
                fullName: "Куцаєв Павло Володимирович",
                position: "МНС НДЛ №33",
                orcid: "0000-0002-3235-3316",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Мальцева Ірина Робертівна",
                position: "СНС НДЛ №33",
                orcid: "0000-0001-6073-4637",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Побережець Тетяна Василівна",
                position: "НС НДЛ №33",
                orcid: "0000-0001-8007-8614",
                section: "НЦЗІ"
            },
            {
                rank: "Підполконик",
                fullName: "Ткаченко Андрій Леонідович",
                position: "Начальник НДУ №4",
                orcid: "0000-0002-9789-8536",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Бондаренко Олег Євгенійович",
                position: "Начальник НДВ №41 – заступник начальника НДУ №4",
                orcid: "0000-0002-9123-7462",
                section: "НЦЗІ"
            },
            {
                rank: "Полковник",
                fullName: "Бестюк Андрій Іванович",
                position: "ПНС НДВ №41",
                orcid: "0009-0003-3845-1827",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Сергієнко Андрій Васильович",
                position: "ПНС НДВ №41",
                orcid: "0000-0001-5336-2089",
                section: "НЦЗІ"
            },
            {
                rank: "Полковник",
                fullName: "Бригадир Сергій Петрович",
                position: "СНС НДВ №41",
                orcid: "0000-0003-1977-552X",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Гетьман Алевтина Вячеславівна",
                position: "СНС НДВ №41",
                orcid: "0000-0002-6397-7412",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Прохорський Сергій Ігорович",
                position: "НС НДВ №41",
                orcid: "0000-0002-6369-2601",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Бохно Тарас Романович",
                position: "НС НДВ №41",
                orcid: "0000-0002-7033-8723",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Івченко Микола Миколайович",
                position: "Начальник ПК НДВ №42",
                orcid: "0000-0002-0039-2812",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Карабань Олександр Валерійович",
                position: "ПНС ПК НДВ №42",
                orcid: "0000-0002-5286-7373",
                section: "НЦЗІ"
            },
            {
                rank: "Майор",
                fullName: "Зінченко Ірина Анатоліївна",
                position: "СНС ПК НДВ №42",
                orcid: "0000-0002-6516-9558",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Шугалій Ольга Олександрівна",
                position: "СНС ПК НДВ №42",
                orcid: "0000-0002-6587-0096",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Цимбал Ірина Володимирівна",
                position: "НС ПК НДВ №42",
                orcid: "0000-0001-7294-3794",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Безнosenко Сергій Юрійович",
                position: "Начальник НДВ №43",
                orcid: "0000-0002-1045-1492",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Білий Олександр Анатолійович",
                position: "ПНС НДВ №43",
                orcid: "0000-0003-3056-8652",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Креденцер Борис Петрович",
                position: "СНС НДВ №43",
                orcid: "0000-0003-1920-2107",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Ільєнко Оксана Вікторівна",
                position: "СНС НДВ №43",
                orcid: "0000-0001-9677-1747",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Самельгюк Вікторія Пилипівна",
                position: "НС НДВ №43",
                orcid: "0009-0009-1801-966X",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Глобін Андрій Вікторович",
                position: "НС НДВ №43",
                orcid: "0000-0001-5335-6869",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Остапук Олександр Іванович",
                position: "Начальник НДЛ НДВ №43",
                orcid: "0000-0001-6567-9525",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Савицький Леонід Миколайович",
                position: "ТЗС НДЛ НДВ №43",
                orcid: "0000-0001-9133-3334",
                section: "НЦЗІ"
            },
            {
                rank: "Підполковник",
                fullName: "Коротченко Людмила Анатоліївна",
                position: "ПНС НДЛ НДВ №43",
                orcid: "0000-0001-7623-4290",
                section: "НЦЗІ"
            },
            {
                rank: "Старший лейтенант",
                fullName: "Атаманенко Микола Валерійович",
                position: "МНС НДЛ НДВ №43",
                orcid: "0000-0001-5381-0224",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Гуржій Ірина Анатоліївна",
                position: "СНС НДЛ НДВ №43",
                orcid: "0000-0003-2786-2551",
                section: "НЦЗІ"
            },
            {
                rank: "Працівник ЗСУ",
                fullName: "Пономаренко Зоя Миколаївна",
                position: "НС НДЛ НДВ №43",
                orcid: "0000-0002-3036-3334",
                section: "НЦЗІ"
            },
            {
                rank: "Генерал-майор",
                fullName: "Остапчук Віктор Миколайович",
                position: "Начальник Військового інституту телекомунікацій та інформатизації",
                orcid: "0000-0001-5686-0198",
                section: "Керівництво ВІТІ"
            },
            {
                rank: "Полковник",
                fullName: "Сілко Олексій Вікторович",
                position: "Заступник начальника інституту з навчальної роботи",
                orcid: "0000-0001-6605-6945",
                section: "Керівництво ВІТІ"
            },
            {
                rank: "Полковник",
                fullName: "Радзівілов Григорій Данилович",
                position: "Заступник начальника інституту з наукової роботи",
                orcid: "0000-0002-5788-8173",
                section: "Керівництво ВІТІ"
            },
            {
                rank: "Полковник",
                fullName: "Черня Ігор Петрович",
                position: "Начальник факультету інформаційних технологій",
                orcid: "0009-0008-5334-9894",
                section: "Керівництво ВІТІ"
            },
            {
                rank: "Підполковник",
                fullName: "Лебідь Євген Віцентійович",
                position: "Заступник начальника факультету з навчальної та наукової роботи-начальник навчальної частини факультету телекомунікаційних систем",
                orcid: "0000-0002-5259-6921",
                section: "Керівництво ВІТІ"
            },
            {
                rank: "Полковник",
                fullName: "Троцько Олександр Олександрович",
                position: "Заступник начальника факультету з навчальної та наукової роботи-начальник навчальної частини факультету інформаційних технологій",
                orcid: "0000-0001-7535-5023",
                section: "Керівництво ВІТІ"
            },
            {
                rank: "Полковник",
                fullName: "Гуцко Андрій Володимирович",
                position: "Заступник начальника факультету з навчальної та наукової роботи-начальник навчальної частини факультету бойового застосування систем управління та зв’язку",
                orcid: "0000-0002-4526-0012",
                section: "Керівництво ВІТІ"
            },
            {
                fullName: "Лазута Роман Григорович",
                orcid: "0000-0002-8584-1110",
                section: "НОВ",
                position: "СНС",
                rank: "Працівник ЗСУ"
            },
            {
                fullName: "Головко Олена Євгеніївна",
                orcid: "0009-0002-7549-8125",
                section: "НОВ",
                position: "НС",
                rank: "Працівник ЗСУ"
            },
            {
                fullName: "Куцаєв Володимир Вікторович",
                orcid: "0000-0001-8213-4739",
                section: "НОВ",
                position: "МНС",
                rank: "Працівник ЗСУ"
            },
            {
                fullName: "Гуржій Павло Миколайович",
                orcid: "0000-0002-2552-229X",
                position: "Докторант",
                rank: "Полковник",
                section: "НОВ-адьюнкти"
            },
            {
                fullName: "Бєляков Роберт Олегович",
                orcid: "0000-0001-9882-3088",
                position: "Докторант",
                rank: "Підполковник",
                section: "НОВ-адьюнкти"
            },
            {
                fullName: "Ковальчук Олег Олександрович",
                orcid: "0000-0003-1372-6284",
                position: "Ад’юнкт",
                rank: "Підполковник",
                section: "НОВ-адьюнкти"
            },
            {
                fullName: "Хоменко Павло Володимирович",
                orcid: "0000-0002-8543-1971",
                position: "Ад’юнкт",
                rank: "Підполковник",
                section: "НОВ-адьюнкти"
            },
            {
                fullName: "Думітраш Ольга Вячеславівна",
                orcid: "0000-0002-2608-8624",
                position: "Ад’юнкт",
                rank: "Майор",
                section: "НОВ-адьюнкти"
            },
            {
                fullName: "Долженко Галина Вікторівна",
                orcid: "0009-0005-2940-7087",
                position: "Ад’юнкт",
                rank: "Майор",
                section: "НОВ-адьюнкти"
            },
            {
                fullName: "Артюх Сергій Григорович",
                orcid: "0000-0003-2142-1552",
                position: "Ад’юнкт",
                rank: "Підполковник",
                section: "НОВ-адьюнкти"
            },
            {
                fullName: "Меркотан Дмитро Юрійович",
                orcid: "0000-0003-1425-9948",
                position: "Ад’юнкт",
                rank: "Підполковник",
                section: "НОВ-адьюнкти"
            },
            {
                fullName: "Поляк Ілля Євгенійович",
                orcid: "0000-0002-5469-3215",
                position: "Ад’юнкт",
                rank: "Майор",
                section: "НОВ-адьюнкти"
            },
            {
                fullName: "Кисиленко Дар’я Юріївна",
                orcid: "0000-0001-5491-6231",
                position: "Ад’юнкт",
                rank: "Майор",
                section: "НОВ-адьюнкти"
            },
            {
                fullName: "Павлюк Дмитро Олександрович",
                orcid: "0000-0001-8461-3899",
                position: "Ад’юнкт",
                rank: "Майор",
                section: "НОВ-адьюнкти"
            },
            // {
            //     fullName: "Носков Олексій Олексійович",
            //     orcid: "відсутній",
            //     position: "Ад’юнкт",
            //     rank: "Полковник",
            //     section: "НОВ-адьюнкти"
            // },
            {
                fullName: "Гаман Олександр Васильович",
                orcid: "0000-0003-4676-3321",
                position: "Ад’юнкт",
                rank: "Підполковник",
                section: "НОВ-адьюнкти"
            },
            {
                fullName: "Власенко Олександр Володимирович",
                orcid: "0000-0001-6671-870X",
                position: "Ад’юнкт",
                rank: "Підполковник",
                section: "НОВ-адьюнкти"
            },
            {
                fullName: "Болотюк Юлія Володимирівна",
                orcid: "0000-0002-3805-6419",
                position: "Ад’юнкт",
                rank: "Майор",
                section: "НОВ-адьюнкти"
            },
            {
                fullName: "Громлюк Катерина Андріївна",
                orcid: "0000-0002-0617-7849",
                position: "Ад’юнкт",
                rank: "Майор",
                section: "НОВ-адьюнкти"
            },
            {
                fullName: "Погребняк Сергій Васильович",
                orcid: "0000-0002-9104-7781",
                position: "Ад’юнкт",
                rank: "Підполковник",
                section: "НОВ-адьюнкти"
            },
            {
                fullName: "Цімура Юрій Васильович",
                orcid: "0000-0002-6269-3821",
                position: "Ад’юнкт",
                rank: "Підполковник",
                section: "НОВ-адьюнкти"
            },
            {
                fullName: "Сінько Вікторія Володимирівна",
                orcid: "0000-0003-1380-3390",
                position: "Ад’юнкт",
                rank: "Майор",
                section: "НОВ-адьюнкти"
            },
            {
                fullName: "Лаврик Іван Васильович",
                orcid: "0000-0002-3433-9083",
                position: "Ад’юнкт",
                rank: "Капітан",
                section: "НОВ-адьюнкти"
            }

        ];

        teachers1.forEach(item =>{
        try {
            const response =  axios.post(
                `https://us-central1-orcid-194b3.cloudfunctions.net/api/addTeacher`,
                item,
                {
                    headers: {
                        'Content-Type': 'application/json',
                    },
                }
            );
            // props.updateTeacherList(departmentTeacher)
        } catch (error) {
            console.error('Ошибка при выполнении запроса:', error);
        }
        })

        closeModal();
    };
    return (
        <div>
            <button className='submit-button' onClick={openModal}>{props.nameModal}</button>
            {props.nameModal === 'Додати викладача'
                &&
                <Modal
                    isOpen={modalIsOpen}
                    onRequestClose={closeModal}
                    className="custom-modal-content"
                    overlayClassName="custom-modal-overlay"
                >
                    <div className="modal-header">
                        <h1>Введіть дані</h1>
                        <button className="close-button" onClick={closeModal}>
                            &#10006;
                        </button>
                    </div>
                    <div className="modal-body">
                        <div className="input-container">
                            <label htmlFor="input1" id='rank' className="input-label">
                                Звання:
                            </label>
                            <select className="custom-input"
                                onChange={handleRankTeacherChange}
                            >
                                {ranks.map(item => {
                                    return <option
                                        key={item}
                                    >{item}</option>
                                })}
                            </select>
                        </div>
                        <div className="input-container">
                            <label htmlFor="input1" className="input-label">
                                Прізвище Імя:
                            </label>
                            <input
                                type="text"
                                id="input1"
                                value={nameTeacher}
                                onChange={handleTeacherNameChange}
                                className="custom-input"
                            />
                        </div>
                        <div className="input-container">
                            <label htmlFor="input1" className="input-label">
                                Посада:
                            </label>
                            <input
                                type="text"
                                id="input1"
                                value={positionTeacher}
                                onChange={handlePositionTeacherChange}
                                className="custom-input"
                            />
                        </div>
                        <div className="input-container">
                            <label htmlFor="input2" className="input-label">
                                Orcid link:
                            </label>
                            <input
                                type="text"
                                id="input2"
                                value={orcidTeacher}
                                onChange={handleTeacherOrcidChange}
                                className="custom-input"
                            />
                        </div>
                        <div className="input-container">
                            <label htmlFor="input2" className="input-label">
                                Оберіть секцію:
                            </label>
                            <select className="custom-input"
                                onChange={handleSectionChange}
                            >
                                {props.departments.map(item => {
                                    return <option
                                        key={item.sectionDepartment}
                                    >{item.sectionDepartment}</option>
                                })}
                            </select>
                        </div>
                    </div>
                    <div className="modal-footer">
                        <button type="submit" className="submit-button" onClick={handleSubmit}>
                            Додати викладача
                        </button>
                    </div>
                </Modal>
            }
            {props.nameModal === 'Додати кафедру'
                &&
                <Modal
                    isOpen={modalIsOpen}
                    onRequestClose={closeModal}
                    className="custom-modal-content"
                    overlayClassName="custom-modal-overlay"
                >
                    <div className="modal-header">
                        <h1>Введіть дані</h1>
                        <button className="close-button" onClick={closeModal}>
                            &#10006;
                        </button>
                    </div>
                    <div className="modal-body">
                        <div className="input-container">
                            <label htmlFor="input1" className="input-label">
                                Оберіть вид секції:
                            </label>
                            <select className="custom-input"
                                onChange={handleTypeSectionChange}
                            >
                                <option>Кафедра</option>
                                <option>Інше</option>
                            </select>
                        </div>

                        {typeSection === 'Кафедра'
                            ?
                            <div className="input-container">
                                <label htmlFor="input1" className="input-label">
                                    Номер кафедри:
                                </label>
                                <input
                                    type="number"
                                    id="input1"
                                    onChange={handleTeacherDepartmentChange}
                                    className="custom-input"
                                />
                            </div>
                            :
                            <div className="input-container">
                                <label htmlFor="input1" className="input-label">
                                    Назва секції:
                                </label>
                                <input
                                    type="text"
                                    id="input1"
                                    onChange={handleTeacherDepartmentChange}
                                    className="custom-input"
                                />
                            </div>
                        }

                    </div>
                    <div className="modal-footer">
                        <button type="submit" className="submit-button" onClick={addNewDepartmentHandler}>
                            Додати кафедру
                        </button>
                    </div>
                </Modal>
            }


        </div>
    );
}

export default MyModal;
